# 4.5 Data Consistency Checks Reading

# Import Data

In [6]:
# Importing Libraries
import pandas as pd
import numpy as np
import os

In [7]:
path = r"C:\Users\malac\Documents\Instacart Basket Analysis CF"

In [8]:
path

'C:\\Users\\malac\\Documents\\Instacart Basket Analysis CF'

In [10]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)
#orders_wrangled import

In [80]:
#products import
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

# 4.5 Reading

In [11]:
df_ords.shape

(3421083, 8)

In [81]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [82]:
df_test = pd.DataFrame()

In [83]:
df_test['mix'] = ['a', 'b', 1, True]

In [84]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [85]:
# Check for mixed typed data
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [86]:
df_test['mix'] = df_test['mix'].astype('str')

In [87]:
#find missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [88]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]
#df_nan is dataset of missing values

In [89]:
df_nan.head(16)

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [90]:
df_prods.median

<bound method NDFrame._add_numeric_operations.<locals>.median of        product_id                                       product_name  \
0               1                         Chocolate Sandwich Cookies
1               2                                   All-Seasons Salt
2               3               Robust Golden Unsweetened Oolong Tea
3               4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4               5                          Green Chile Anytime Sauce
...           ...                                                ...
49688       49684          Vodka, Triple Distilled, Twist of Vanilla
49689       49685                 En Croute Roast Hazelnut Cranberry
49690       49686                                   Artisan Baguette
49691       49687         Smartblend Healthy Metabolism Dry Cat Food
49692       49688                             Fresh Foaming Cleanser

       aisle_id  department_id  prices
0            61             19     5.8
1           104             13     9.3
2            94              7     4.5
3            38              1    10.5
4             5             13     4.3
...         ...            ...     ...
49688       124              5     5.3
49689        42              1     3.1
49690       112              3     7.8
49691        41              8     4.7
49692        73             11    13.5

[49693 rows x 5 columns]>

df['column with missings'].fillna(median value, inplace=True) 

#replace missing values with median/mean

In [91]:
df_prods.shape

(49693, 5)

In [92]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False] 
#new dataset with product_name removed

In [93]:
df_prods_clean.shape

(49677, 5)

#another way to drop all missing values

df_prods.dropna(inplace = True)

#drop NaNs from a particular column

df_prods.dropna(subset = [‘product_name’, inplace = True)

In [94]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]
#look for duplicates

In [95]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [96]:
df_prods_clean.shape

(49677, 5)

In [97]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()
#new dataset with dups removed

In [98]:
df_prods_clean_no_dups.shape

(49672, 5)

#  4.5 Task

In [99]:
# Check for mixed typed data
for col in df_prods.columns.tolist():
  weird = (df_prods[[col]].applymap(type) != df_prods[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods[weird]) > 0:
    print (col)

product_name

In [100]:
df_prods['product_name'] = df_prods['product_name'].astype('str')

## 1.

In [73]:
# Check for mixed typed data
for col in df_prods.columns.tolist():
  weird = (df_prods[[col]].applymap(type) != df_prods[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods[weird]) > 0:
    print (col)

In [104]:
df_prods['product_name'] = df_prods['product_name'].astype('str')

## 2.

In [105]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

The first thing that stands out to me is the Unnamed:0 column. That needs tp be replaced. Also the max for oder_hourof_day looks to low.

## 3.

In [106]:
# Check for mixed typed data
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

## 4.

I did not find any mixed data in my df_ords dataset.

## 5.

In [107]:
#check for missing values
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
eval_set                       0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

The only column that has any missing data is the days_since_prior_order. One explanation for this could be because it is representing the orders of new customers. I would not make changes in this situation, but you can consider removing the column, using interpolation to replace the missing valuses, or you could replace them with the mean/median.

## 6.

In [108]:
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]
#df_ords_nan is dataset of missing values for orders dataset

In [109]:
df_ords_nan

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
11,11,2168274,2,prior,1,2,11,NaN
26,26,1374495,3,prior,1,1,14,NaN
39,39,3343014,4,prior,1,6,11,NaN
45,45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,prior,1,4,12,NaN
3420934,3420934,3189322,206206,prior,1,3,18,NaN
3421002,3421002,2166133,206207,prior,1,6,19,NaN
3421019,3421019,2227043,206208,prior,1,1,15,NaN
3421069,3421069,3154581,206209,prior,1,3,11,NaN

For this instance I would check with a person in charge before making any changes to missing values because I think they represent a first time customer.

## 7.

In [110]:
df_ords_dups = df_ords[df_ords.duplicated()]
#look for duplicates

In [111]:
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, eval_set, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

## 8.

I found no duplicates for this dataset. If I did find duplicates, I would remove them in a new dataset with the following command.

df_ords_no_dups = df_ords.drop_duplicates()
#new dataset with dups removed

# Exports

In [112]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'df_prods_cleaan_no_dups.csv'))

In [33]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'df_ords_cleaan_no_dups.csv'))

NameError: name 'df' is not defined